<!DOCTYPE html>
<html lang="zh-Hant-TW">

<head>
    <!-- Global site tag (gtag.js) - Google Analytics -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-144500554-1"></script>
    <script>
        window.dataLayer = window.dataLayer || [];

        function gtag() {
            dataLayer.push(arguments);
        }
        gtag('js', new Date());

        gtag('config', 'UA-144500554-1');
    </script>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>來去台灣博物館</title>

    <!-- FAVIOCN -->
    <link rel="shortcut icon" href="./img/favicon.ico" type="image/x-icon">

    <!-- 網站META -->
    <!-- 說明最好要設，讓Google搜尋能抓到網站說明 -->
    <meta name="keywords" content="台灣博物館,文物館,歷史收藏">
    <meta name="description" content="台灣博物館介紹網">
    <meta name="author" content="LIN-YI-JYUN">

    <!-- FACEBOOK META -->
    <meta property="og:title" content="台灣博物館">
    <meta property="og:image" content="./img/Geography_03.jpg">
    <meta property="og:description" content="台灣博物館介紹網">
    <meta property="og:site_name" content="台灣博物館">

    <link rel="stylesheet" href="./css/bootstrap.min.css">
    <link rel="stylesheet" href="./css/all.min.css">
    <link rel="stylesheet" href="./css/coffee.css">
    <link rel="stylesheet" href="./css/animate.css">
    <link rel="stylesheet" href="./css/dataTables.bootstrap4.min.css">
    <link rel="stylesheet" href="./packages//core//main.min.css">
    <link rel="stylesheet" href="./packages/bootstrap/main.min.css">
    <!-- PWA -->
    <link rel="manifest" href="manifest.json">

</head>

<body>

    <div id="particles-js"></div>
    <script src="./particles.min.js"></script>
    <script>
        particlesJS.load('particles-js', 'particlesjs-config.json', function () {});
    </script>


    <nav class="navbar navbar-expand-lg navbar-dark bg-warning fixed-top shadow-sm">

        <div class="container">
            <a class="navbar-brand" href="./index.html">
                <img src="./img/LOGO.png" width="190" height="45" class="d-inline-block align-top" alt="">

            </a>
            <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent"
                aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse navbar-collapse" id="navbarSupportedContent">
                <ul class="navbar-nav mr-auto">
                    <li class="nav-item">
                        <a class="nav-link" href="./index.html" style="color:#000">
                            <i class="fas fa-home"></i> 台灣知名博物館
                        </a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link" href="./land.php" style="color:#000">
                            <i class="fas fa-hotel"></i> 全台博物館資訊
                        </a>
                    </li>
                    <li class="nav-item active">
                        <a class="nav-link" href="./map.php">
                            <i class="fas fa-hotel"></i> 各縣市代表博物館介紹
                        </a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link" href="./chart.html" style="color:#000">
                            <i class="far fa-copy"></i> 全台博物館分布數
                        </a>
                    </li>

                </ul>
            </div>
        </div>
    </nav>

    <div class="container-fluid" id="loading">
        <div class="row h-100">
            <div class="col-12 text-center align-self-center">
                <img src="./img/loading-coffee.svg" alt="" width="300" height="300">
                <p class="text-white">載入中...</p>
            </div>
        </div>
    </div>




    <?php
//初始化 curl
  $curl = curl_init();
  //識別發出請求的軟體,/瀏覽器類型
  curl_setopt($curl, CURLOPT_USERAGENT,"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/51.0.2704.103 Safari/537.36");
  
  //預設為ture,要驗證https ssl憑證
  //如果來源是https網站時,沒有做其他設定會錯誤
  curl_setopt($curl, CURLOPT_SSL_VERIFYPEER,false);
  //將curl回傳的資料以字串接收,而不是直接顯示
/*   curl_setopt($curl, CURLOPT_RETURNTRANSFER,false); */  //AA
  curl_setopt($curl, CURLOPT_RETURNTRANSFER,true);

  curl_setopt($curl, CURLOPT_URL,"https://cloud.culture.tw/frontsite/trans/emapOpenDataAction.do?method=exportEmapJson&typeId=H");
  


  //curl_exec($curl); //AA
  $result = curl_exec($curl);
  //關閉curl
  curl_close($curl);

  $json=json_decode($result,true);
?>
    <div class="container" style="margin-top: 0px; margin-bottom:0px;position:relative">
        <div class="row">
            <div class="col-12 col-md-6 col-lg-6">
                <svg version="1.1" style="margin:80px 0px 0px 0px;" xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" width="595.28px" height="841.89px"
                    viewBox="0 0 595.28 841.89" enable-background="new 0 0 595.28 841.89" xml:space="preserve">
                    <path id="1" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M265.359,654.65
	c5.683-13.645,3.752-31.236,23.789-36.796c10.578-2.931,11.102-16.866,4.021-26.351c-5.623-7.529-9.438-16.44-13.73-24.907
	c-0.824-1.626-1.011-4.884,0.01-5.936c11.396-11.765,7.354-27.118,9.098-40.829c1.344-10.575,5.769-18.53,12.791-25.431
	c6.822-6.703,13.634-9.84,23.671-3.094c13.634,9.164,28.776,16.102,43.37,23.812c11.063,5.845,15.763,3.63,19.229-8.123
	c3.84-13.027,8.106-25.93,11.978-38.948c1.174-3.945,0.97-8.402,2.634-12.063c1.575-3.463,4.325-7.857,7.408-8.687
	c2.37-0.644,7.459,2.976,8.798,5.874c1.561,3.384,1.135,8.229,0.193,12.107c-2.052,8.442-4.201,17.021-7.741,24.9
	c-4.352,9.688-5.458,19.012-3.075,29.387c0.871,3.785-0.806,8.861-2.85,12.483c-7.025,12.436-14.728,24.492-22.182,36.685
	c-0.726,1.188-1.406,3.219-2.323,3.349c-17.179,2.454-13.702,21.037-23.345,29.793c-10.227,9.287-18.864,20.59-26.89,31.934
	c-4.68,6.614-7.786,14.778-9.887,22.695c-5.018,18.924-9.363,38.046-13.228,57.24c-1.19,5.914-4.147,7.056-8.623,5.75
	c-8.028-2.337-12.279-7.607-17.44-15.031c-8.921-12.836-6.902-27.846-13.781-40.392C265.832,661.485,265.989,658.025,265.359,654.65
	z" />
                    <path id="2" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M189.623,682.116
	c2.31-8.086,4.684-13.66,5.33-19.435c0.616-5.506-0.766-11.207-0.918-16.834c-0.356-13.186-0.797-26.383-0.365-39.548
	c0.057-1.685,5.002-3.431,7.861-4.756c5.201-2.411,12.256-3.122,15.473-7.051c7.894-9.637,15.831-10.387,26.741-5.906
	c5.921,2.432,13.198,1.553,19.765,4.292c0.667-0.135,1.532-0.046,1.972-0.438c9.586-8.564,21.186-5.813,25.803,6.675
	c2.372,6.417,1.182,11.867-6.271,15.333c-19.048,8.858-28.941,33.618-22.2,53.671c1.768,5.257,4.651,10.857,4.148,16.02
	c-1.258,12.941,7.736,21.445,13.051,30.967c3.01,5.391,12.518,8.179,19.641,9.945c6.237,1.541,7.59,4.397,8.062,9.884
	c0.728,8.479,2.963,16.882,3.05,25.333c0.053,5.163-3.436,10.272-4.054,15.553c-1.032,8.826-1.039,17.776-1.475,26.632
	c-5.874-5.131-11.196-9.782-17.693-15.463c-1.979,4.062-3.369,6.914-4.852,9.959c-3.916-5.595-8.59-10.805-11.471-16.862
	c-2.305-4.85-4.154-11.083-3.131-16.066c1.524-7.423,0.318-13.048-3.117-19.675c-13.958-26.923-38.628-43.181-60.719-61.919
	C201.569,680.15,195.288,682.116,189.623,682.116z" />
                    <path id="3" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83"
                        d="M181.307,678.155
	c-10.053-11.27-20.158-22.497-30.087-33.877c-0.966-1.106-1.71-4.005-1.083-4.663c7.56-7.911,0.234-13.041-3.107-19.091
	c-5.997-10.86-11.683-21.895-18.687-35.095c9.623,1.243,16.76,1.484,23.53,3.189c13.304,3.347,27.768-3.466,32.939-16.322
	c0.258-0.644,0.294-1.456,0.72-1.939c9.845-11.151,20.15-21.935,29.453-33.524c5.488-6.83,10.279-14.535,13.811-22.544
	c4.561-10.342,8.297-20.374,20.23-25.01c4.427-1.72,7.374-7.043,11.237-10.453c13.809-12.186,26.101-27.583,47.714-23.443
	c-2.267,3.299-6.258,6.614-6.197,9.856c0.044,2.362,5.468,4.578,8.42,6.948c1.5,1.206,4.166,2.854,3.978,3.868
	c-0.38,2.023-2.044,4.137-3.74,5.527c-5.085,4.157-10.756,7.636-15.631,12.005c-12.853,11.528-11.06,27.663-13.175,42.675
	c-0.925,6.571-4.429,12.756-5.605,19.321c-1.194,6.673-0.965,13.597-0.229,20.55c-8.801,11.975-21.478,7.543-33.202,4.428
	c-8.588-2.281-21.306,1.234-27.715,8.249c-3.343,3.658-9.147,6.373-14.135,6.949c-9.365,1.083-14.176,4.57-13.197,14.513
	c1.414,14.369,3.386,28.761,3.494,43.154c0.055,7.629-3.326,15.281-5.152,22.923C184.359,676.953,182.833,677.555,181.307,678.155z" />
                    <path id="4" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M104.887,497.238
	c2.89,0.649,5.223,1.018,7.456,1.705c11.601,3.548,20.465-1.07,26.983-11.213c5.879-9.146,13.867-15.461,26.691-14.879
	c9.113,0.412,18.101-1.891,23.648,7.685c1.838,3.176,2.444,7.042,3.96,10.439c3.378,7.568,6.676,15.206,10.728,22.409
	c0.802,1.432,4.839,1.419,7.377,1.399c3.542-0.033,7.072-0.699,13.833-1.456c-4.046,6.614-6.119,10.849-8.956,14.483
	c-8.42,10.788-16.764,21.687-25.875,31.882c-7.085,7.926-14.908,15.313-23.176,21.984c-2.742,2.211-7.93,2.138-11.923,1.892
	c-9.705-0.597-19.365-1.9-29.039-2.938c-0.66-0.069-1.596-0.069-1.907-0.481c-8.042-10.571-19.791-20.121-23.173-32.042
	C95.516,526.966,98.045,521.124,104.887,497.238z" />
                    <path id="5" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M277.705,456.352
	c-17.381,15.551-36.599,32.74-56.032,50.126c-3.078-0.208-7.909-0.531-12.742-0.858c-1.046,1.145-2.093,2.285-3.14,3.429
	c-1.552-7.521-1.108-16.434-5.139-22.234c-5.742-8.264-14.05-18.922-22.543-20.229c-17.239-2.658-33.873,2.923-45.17,18.963
	c-6.722,9.542-15.975,12.709-27.267,4.048c0.612-11.941,1.271-24.752,2.021-39.346c10.303,6.371,14.577,1.197,22.101-3.328
	c13.744-8.266,25.465-19.647,40.048-26.22c5.961-2.685,12.321-1.773,18.151,3.683c3.736,3.499,10.059,5.381,15.389,5.786
	c9.666,0.735,19.485,0.18,29.186-0.556c4.392-0.335,8.653-2.396,12.868-4.862c6.618,0.811,11.924,2.143,14.482,11.68
	C262.032,444.305,271.8,450.122,277.705,456.352z" />
                    <path id="6" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M420.979,440.11
	c-7.557,1.864-14.575,2.846-20.86,5.538c-2.315,0.994-3.28,5.93-4.155,9.253c-0.753,2.865,0.044,6.156-0.788,8.98
	c-4.033,13.69-8.679,27.2-12.507,40.938c-2.022,7.265-5.177,9.163-11.956,5.434c-14.152-7.791-28.56-15.117-42.636-23.039
	c-3.046-1.713-7.447-5.297-7.263-7.716c0.751-9.866-4.822-12.76-16.324-13.885c9.72-3.602,13.773-6.966,14.412-15.611
	c0.461-6.184,5.479-14.638,15.422-14.312c1.277,0.041,3.146-0.515,3.803-1.45c9.969-14.243,19.581-28.857,19.044-47.1
	c-0.113-3.754-4.569-7.379-6.926-10.916c3.621-9.002,7.685-18.134,10.874-27.556c1.141-3.369,1.667-8.543-0.121-11.009
	c-5.746-7.926-1.531-13.174,2.676-19.51c3.061-4.616,4.464-10.339,6.549-15.596c0.374-0.94,0.217-2.702,0.731-2.89
	c13.167-4.718,4.906-12.095,2.426-18.763c-2.658-7.155-0.304-12.153,4.06-18.73c8.979-13.528,18.973-13.005,31.814-7.752
	c7.686,3.148,15.224,2.911,23.966-0.576c7.489-2.993,17.423-0.335,26.14,0.838c1.082,0.147,2.423,6.811,1.613,9.931
	c-0.648,2.514-4.227,4.422-6.752,6.257c-6.492,4.718-10.175,8.866-9.922,18.979c0.367,14.702-5.207,29.502-7.843,44.334
	c-3.648,20.538-6.727,41.173-10.433,61.694c-1.841,10.208-5.133,20.173-6.602,30.413C418.686,431.42,420.564,436.923,420.979,440.11
	z" />
                    <path id="7" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83"
                        d="M207.773,328.25
	c6.357,2.413,10.688,4.092,15.047,5.7c15.851,5.857,23.281,2.51,29.095-13.073c3.446-9.234,7.437-11.001,13.675-8.273
	c10.148-3.704,18.495-6.156,26.311-9.754c9.87-4.545,19.673-9.455,28.81-15.296c5.892-3.766,9.968-2.919,13,2.317
	c4.817,8.329,11.688,10.965,20.89,10.31c3-0.212,8.412,1.332,8.762,2.94c0.67,3.09-0.989,7.039-2.579,10.178
	c-2.024,4.006-5.291,7.379-7.334,11.377c-1.162,2.264-2.265,6.177-1.146,7.735c9.085,12.639,1.976,23.34-4.031,33.715
	c-3.988,6.885-7.574,11.99,1.041,18.4c5.055,3.757-0.722,26.841-6.689,32.266c-2.647,2.402-4.439,5.767-6.525,8.754
	c-0.953,1.365-1.625,4.102-2.524,4.143c-10.854,0.526-13.962,9.867-20.106,16.117c-3.13,3.181-10.192,3.798-15.328,3.434
	c-10.96-0.772-23.526,1.991-30.699-10.402c-0.513-0.884-2.02-1.596-1.984-2.336c0.691-14.053-11.71-15.708-20.148-20.406
	c-3.606-2.005-9.28-1.103-13.841-0.408c-9.595,1.46-12.856-0.821-11.271-10.167c1.332-7.849-0.072-16.919,8.332-22.543
	c0.651-0.438-1.537-8.323-3.431-8.817c-10.091-2.633-13.583-8.222-13.229-18.621C212.144,347.467,209.56,339.3,207.773,328.25z" />
                    <path id="8" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M236.866,424.578
	c-13.276,0-26.557,0.171-39.823-0.182c-2.012-0.053-4.149-2.314-5.895-3.916c-8.241-7.565-17.603-8.584-27.221-2.75
	c-11.969,7.256-24.069,14.307-35.797,21.936c-3.27,2.125-5.424,5.968-8.09,9.024c-4.518-1.283-9.036-2.571-14.614-4.156
	c-3.101-22.625,7.514-41.455,20.1-59.622c0.716-1.034,2.167-2.069,3.36-2.179c29.02-2.71,57.484,2.505,87.268,5.833
	c-0.649,6.192-1.173,11.936-1.865,17.66c-1.653,13.689,0.455,15.988,14.404,15.329c2.668-0.126,5.325-0.482,7.991-0.735
	C236.745,422.076,236.807,423.326,236.866,424.578z" />
                    <path id="9" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83"
                        d="M219.53,381.875
	c-26.602-1.946-56.023-4.092-87.757-6.415c14.753-26.056,29.651-52.366,43.629-77.056c9.587,8.715,18.932,17.21,27.855,25.325
	c0,4.014-0.352,8.764,0.077,13.444c0.757,8.232,0.631,16.916,3.401,24.487C209.485,369.161,215.357,375.514,219.53,381.875z" />
                    <path id="10" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M200.617,247.728
	c6.601,4.21,11.69,7.121,16.412,10.54c10.215,7.397,20.391,9.643,31.85,2.276c2.685-1.729,7.319-1.558,10.732-0.8
	c7.935,1.761,15.76,4.146,23.469,6.756c17.333,5.886,29.827-2.922,42.847-12.504c9.764-7.183,21.008-12.354,32.689-19.05
	c4.302,12.821,13.38,13.964,26.942,10.249c-7.597,8.814-15.286,14.25-17.619,21.424c-2.305,7.102,0.796,15.96,1.6,24.888
	c-6.767,4.855-22.594,4.921-28.097-0.834c-13.07-13.674-18.713-13.171-33.759-2.796c-8.686,5.989-20.19,7.709-29.917,12.401
	c-11.939,5.765-29.693,3.287-32.141,23.219c-1.016,8.287-9.78,8.564-15.222,6.479c-19.91-7.62-38.77-17.196-47.963-38.434
	c-0.372-0.858-0.53-2.129-0.173-2.931C188.275,275.066,194.382,261.574,200.617,247.728z" />
                    <path id="11" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M258.88,177.555
	c24.189,5.895,38.954,27.905,64.125,31.539c17.039,2.464,23.698,18.301,15.466,30.875c-1.066,1.631-2.498,3.295-4.162,4.228
	c-6.579,3.687-14.041,6.171-19.862,10.771c-16.181,12.774-33.08,6.045-48.958,1.335c-7.166-2.121-12.684-3.805-19.466-0.706
	c-12.174,5.563-29.693,0.817-37.658-10.375c-1.275-1.795-1.872-5.5-0.882-7.249c6.479-11.481,12.988-23.018,20.565-33.777
	c2.919-4.146,8.995-5.915,13.031-9.455C247.45,189.153,253.312,182.985,258.88,177.555z" />
                    <path id="12" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M488.098,110.858
	c-4.601,8.474-9.777,16.694-13.678,25.476c-8.302,18.698-6.603,36.149,7.347,52.107c2.188,2.502,2.857,8.188,1.664,11.466
	c-5.182,14.247-11.497,28.076-17.008,42.211c-2.228,5.72-5.302,6.1-11.157,5.633c-9.528-0.759-18.706-1.867-29.098,1.743
	c-8.994,3.122-21.171-3.063-31.973-4.957c-6.273-1.099-12.694-1.479-18.888-2.901c-3.369-0.773-7.633-2.282-9.211-4.86
	c-1.456-2.372-1.148-7.67,0.625-9.852c8.628-10.621,15.585-21.405,18.124-35.54c1.004-5.589,8.777-11.008,14.674-14.421
	c8.752-5.065,20.279-6.145,20.354-20.302c0.012-2.473,5.056-5.284,8.187-7.304c12.183-7.866,24.781-15.114,36.73-23.309
	c7.68-5.274,14.498-11.798,21.706-17.763C487.03,109.145,487.564,110,488.098,110.858z" />
                    <path id="13" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M262.47,146.765c8.602,3.07,14.7,5.245,20.071,7.162
	c-6.788,4.983-12.856,9.439-19.622,14.406C255.826,161.891,263.662,154.782,262.47,146.765z" />
                    <path id="14" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83"
                        d="M287.676,167.471
	c4.713-8.082,0.498-18.515-7.943-21.367c-3.557-1.197-6.582-3.974-9.85-6.03c5.137-4.55,10.826-13.338,15.295-12.754
	c8.918,1.166,19.065,5.646,25.23,12.087c8.699,9.081,17.044,16.655,29.616,19.647c3.527,0.841,8.99,6.715,8.474,9.246
	c-3.224,15.853,7.87,21.637,18.143,27.982c11.669,7.206,12.145,7.555,2.653,18.113c-5.974,6.639-9.053,16.858-20.081,18.219
	c-2.979-16.035-11.204-26.722-27.356-29.788c-14.089-2.678-25.96-9.373-36.465-18.91c-2.279-2.073-4.87-4.263-7.71-5.156
	c-5.277-1.659-9.611-3.293-5.98-9.896c3.323-6.042,7.589-7.874,13.159-2.358C285.501,167.139,286.744,167.172,287.676,167.471z" />
                    <path id="15" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M376.544,194.168
	c-17.483-6.045-20.528-11.037-22.073-28.144c-0.369-4.08-5.759-9.918-9.896-11.042c-13.005-3.524-22.496-10.501-31.457-20.55
	c-6.283-7.042-16.566-10.521-26.442-16.417c0.309,1.721-0.13,0.744,0.126,0.499c14.355-13.662,29.745-26.22,48.942-31.897
	c6.095-1.803,14.476,0.319,20.589,3.221c10.219,4.853,9.771,16.373,0.085,22.173c-9.413,5.641-9.778,9.021-4.805,19.086
	c4.354,8.813,7.102,18.57,20.026,16.85c0.578-0.077,1.638,0.373,1.815,0.835c3.579,9.316,7.502,18.545,10.277,28.108
	c0.756,2.599-1.892,6.274-3.196,9.364C379.464,188.789,378.066,191.185,376.544,194.168z" />
                    <path id="16" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83" d="M500.857,103.716
	c-5.308,0.458-11.359-0.543-15.759,1.696c-7.837,3.994-14.541,10.154-21.96,15.039c-12.129,7.98-24.462,15.653-36.688,23.485
	c-6.617,4.239-12.521,7.685-14.186,17.561c-0.806,4.788-12.119,8.598-19.295,10.997c-1.89,0.629-7.215-5.118-8.943-8.872
	c-2.261-4.904-1.765-11.066-3.928-16.04c-1.18-2.71-5.88-6.225-8.188-5.722c-13.955,3.058-11.951-10.143-16.572-15.997
	c-4.679-5.922,2.121-7.774,5.919-10.497c10.235-7.338,10.594-20.031,0.982-28.23c-2.07-1.767-4.22-3.43-5.413-4.39
	c10.198-10.731,20.115-21.274,30.192-31.665c1.913-1.971,4.399-3.422,6.727-4.951c12.216-8.016,13.969-5.854,23.24,5.118
	c8.069,9.545,19.797,16.373,30.794,22.913c6.034,3.59,13.838,4.391,20.96,5.927c8.973,1.934,17.382,3.667,21.769,13.675
	c1.527,3.487,7.168,5.167,10.93,7.672C501.243,102.196,501.05,102.956,500.857,103.716z M430.995,104.146
	c-3.103-5.318-6.409-9.373-7.93-14.013c-1.696-5.175-0.344-11.704-2.9-16.164c-3.363-5.861-8.436-11.953-14.299-14.81
	c-4.993-2.433-24.771,15.154-22.372,19.593c4.698,8.694,4.753,18.039,7.837,26.461c2.044,5.584,11.35,8.997,17.971,12.218
	c3.199,1.553,7.701,0.433,11.61,0.523c0-3.425,0-6.847,0-11.335C422.661,106.189,425.885,105.401,430.995,104.146z" />
                    <path id="17" fill-rule="evenodd" clip-rule="evenodd" fill="#F79A83"
                        d="M420.263,97.793
	c-3.675,4.95-6.723,9.054-12.02,16.192c-2.747-6.966-5.352-13.572-7.956-20.178c-1.59-1.79-1.276-7.456-9.055-11.764
    c-0.974-0.536-0.601-6.606,1.012-8.094c4.099-3.777,9.254-6.405,16.612-11.213C412.903,75.175,416.7,86.846,420.263,97.793z" />
                </svg>
            </div>
            <div class="col-12 col-md-6 col-lg-6" style="mar" id="sv">
                <div id="ddd">
                    <h2>你知道台灣各縣市<br>有哪些著名博物館嗎?</h2>
                </div>

                <div id="tht">
                    <span>點地圖詳細了解</span>
                </div>

                <div id="abc">
                    <img id="rightblock" src="./img/banner-image_07.png" alt="">
                </div>
            </div>
        </div>
    </div>


    <div class="container-fluid bg-warning" id="footer" style="position:fixed;bottom:0px;left:0px">
        <div class="row justify-content-center">
            <div class="col-12 text-white text-center">
                <ul class="nav justify-content-center">
                    <li class="nav-item">
                        <a class="nav-link text-white" href="#"><i class="fab fa-facebook-f"></i></a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link text-white" href="#"><i class="fab fa-twitter"></i></a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link text-white" href="#"><i class="fab fa-instagram"></i></a>
                    </li>
                </ul>
                &copy;<script>
                    let d = new Date;
                    document.write(d.getFullYear());
                </script>台灣博物館介紹網
            </div>
        </div>
    </div>
    <div class="modal fade" tabindex="-1" role="dialog" id="modal">
        <div class="modal-dialog modal-dialog-centered" role="document">
            <div class="modal-content">
                <div class="modal-header">
                    <h5 class="modal-title"></h5>
                    <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                        <span aria-hidden="true">&times;</span>
                    </button>
                </div>
                <div class="modal-body">
                    <img src="" alt="" class="w-100 modal-img">
                    <br><br>
                    <h6><i class="fas fa-map-marker-alt text-success"></i>&nbsp;&nbsp;地址：<span
                            class="modal-addr"></span></h6>
                    <h6><i class="fas fa-phone-alt text-success"></i>&nbsp;電話：<span class="modal-tel"></span></h6>
                </div>
                <div class="modal-footer">
                    <button type="button" class="btn btn-secondary" data-dismiss="modal">關閉</button>
                </div>
            </div>
        </div>
    </div>
    <script src="./js/jquery-3.4.1.min.js"></script>
    <script src="./js/bootstrap.bundle.min.js"></script>
    <script src="./js/wow.min.js"></script>
    <script src="./js/jquery.dataTables.min.js"></script>
    <script src="./js/dataTables.bootstrap4.min.js"></script>
    <script src="./packages/core/main.min.js"></script>
    <script src="./packages/bootstrap/main.min.js"></script>
    <script src="./js/popper.min.js"></script>
    <script src="./js/bootstrap.min.js"></script>

    <script>
        $(document).on("readystatechange", function () {
            if (document.readyState == "complete") {
                $("#loading").fadeOut(2000, function () {
                    $("#content").fadeIn(1000);
                    $("#footer").fadeIn(1000);

                    new WOW().init();
                });
            }
        })

        let showtable = $("#showtable").DataTable({
            "language": {
                "url": "./datatables-chinese-traditional.json"
            }
        })


        var $select = $("#tht").find("select");


        let i;
        for (i = 1; i <= 17; i++) {
            let num = `#${i}`;
            const dd = document.getElementById(i);
            dd.onmouseover = function () {
                $(num).css("fill", "#FFF");
                // console.log(dd);
            }
            dd.onmouseout = function () {
                $(num).css("fill", "#F79A83");
            }

        }


        //     const dd = document.getElementById(1);
        // dd.onmouseover = function () {
        //     $("#1").css("fill", "#FFF");
        // }
        // dd.onmouseout = function () {
        //     $("#1").css("fill", "#F79A83");
        // }



        let j;
        for (j = 1; j <= 17; j++) {
            let num = `#${j}`;



            $(function () {

                $(num).on("click", function () {
                    $("#rightblock").fadeOut(1000, function () {

                        if (num == "#1") {
                            $("#rightblock").attr("src", "./img/AA/1.jpg");
                            $("#tht").empty().append(
                                "不同於其他博物館，池上穀倉藝術館的出現不是一時興起的決定，而是一路走來累積了十年的成果。2009年春天，普訊創投董事長柯文昌先生成立了台灣好基金會，以鄉鎮文化為底，豐實生活、觀光、產業的能量，讓每一個台灣人和來到台灣的人，都能體會台灣的風景、善良的人情和深層的文化。"
                            );
                        }
                        if (num == "#2") {
                            $("#rightblock").attr("src", "./img/AA/2.jpg");
                            $("#tht").empty().append(
                                "1991年，「國立海洋生物博物館」籌備處正式成立，篳路藍縷的規劃建設工作於焉展開…，歷經無數的努力與挫折，終於在民國89年2月25日完成「台灣水域館」開館，從此正式朝向國際海洋教育與研究的無限領域邁開腳步。在館務多功能性的思考下，除了教育、學術、保育層面的提昇外，「國立海洋生物博物館」亦朝向社區性、娛樂性、國際性…等全方位的領域拓展；同年七月，館中之水族館部門，在甄選後委由「海景世界企業股份有限公司」負責專業經營管理。此舉，不僅開創國立社教單位首宗委外經營的案例，更徹底落實專業分工的合作理念。"
                            );
                        }
                        if (num == "#3") {
                            $("#rightblock").attr("src", "./img/AA/3.jpg");
                            $("#tht").empty().append(
                                "國立科學工藝博物館，位於台灣高雄市三民區，是台灣第一座應用科學博物館，亦為南台灣第一個國立社教機構。以蒐藏及研究科技文物、展示與科技相關主題、推動科技教育暨提供民眾休閒與終身學習為其主要功能，為行政院於1979年頒定之十二項建設計畫中，將興建博物館列為中央文化設施項目之一。"
                            );
                        }
                        if (num == "#4") {
                            $("#rightblock").attr("src", "./img/AA/4.jpg");
                            $("#tht").empty().append(
                                "臺灣鹽博物館的籌建可追溯到民國八十三年（1994年），當時是立委在立法院要求國營事業應為歷史文化貢獻心力，而計畫興建博物館，但此意見只有當時的臺鹽董事長餘光華深表贊同。而為了興建博物館，臺鹽開始蒐集相關文物及文獻，舉辦攝影比賽和徵集老照片，並進行口述訪談，然而後來在1990年時臺鹽公司因為民營化，將博物館連同鹽田一同繳回國有財產局，並停止編列第三期工程預算而使得其周邊設施與鹽業文化園區後續規劃案等計畫無法進行下去，最後只完成館內八成左右的設施。"
                            );
                        }
                        if (num == "#5") {
                            $("#rightblock").attr("src", "./img/AA/5.jpg");
                            $("#tht").empty().append(
                                "嘉義市立博物館（英文：Chiayi Municipal Museum；簡稱：嘉市博），是嘉義市內的一座博物館，為嘉義市政府文化局的附屬機關，在2004年3月9日開館，位於中華民國嘉義市東區，文化中心的後方。"
                            )
                        }
                        if (num == "#6") {
                            $("#rightblock").attr("src", "./img/AA/6.jpg");
                            $("#tht").empty().append(
                                "1995年由花蓮縣政府與花蓮縣國際藝術村協進會共同主辦「1995花蓮國際石雕戶外創作公開賽」，是花蓮首見的大型藝術活動，也開創了國內地方社團辦理國際石雕活動的先河，第一屆「花蓮國際石雕藝術季」於焉開始，正式型塑花蓮成為國際石雕藝術家匯聚切磋的重鎮，並獲得官方支持。1997年第二屆續由花蓮縣政府主辦、文化局承辦，一舉打響花蓮石雕藝術的名號，其後陸續藉由兩年一次的石雕藝術季競賽模式，十餘年來累積了為數可觀的各國石雕藝術作品。"
                            );
                        }
                        if (num == "#7") {
                            $("#rightblock").attr("src", "./img/AA/7.jpg");
                            $("#tht").empty().append(
                                "舊名為陳列館，於民國66年開館營運，於民國96年正式更名為工藝文化館，由景觀大師楊英風規劃、彭蔭宣及程儀賢兩位建築師合作設計。外型以雙十字為造型符碼，由四支豎柱與橫牆交織，表現手工藝經緯編織型態。內部為4樓層之融合性展覽空間，主要由底層至頂層直立一迴轉樓梯串聯各樓層，藉由視覺角度的流動變化，引領觀眾深刻領略工藝文化。本館定期策辦當代工藝文化藝術主題展覽，包含臺灣多元工藝文化、當代工藝創新、工藝產業發展等相關主題，為提供民眾認識、鑑賞工藝文化之功能以及工藝體驗推廣之場域。"
                            );
                        }
                        if (num == "#8") {
                            $("#rightblock").attr("src", "./img/AA/8.jpg");
                            $("#tht").empty().append(
                                "延平老街上諸多歷史建築，見證了西螺鎮商業繁榮及文化發展的歷史，為讓下一代得以瞭解先人創業的用心與貢獻，財團法人雲林縣螺陽文教基金會，積極奔走延平老街文化館的設立，同時配合政府保護歷史文化的政策；以捷發乾記茶莊作為西螺文化發展之重要據點。許氏族人基於發揚先人勤奮經營的精神及保護具藝術文化價值的茶莊建築，同意無償提供老屋作為「西螺延平老街文化館」之用，並協助整理茶莊相關文物，充實文化館內容，促進地方文史工作的推動，為西螺文藝振興運動釋出助力。"
                            );
                        }
                        if (num == "#9") {
                            $("#rightblock").attr("src", "./img/AA/9.jpg");
                            $("#tht").empty().append(
                                "為使臺灣本土藝術家有一發展平台，台明將公司拋磚引玉，為臺灣本土藝術家們，提供一個免費展覽之場域，讓在地的玻璃工藝能有一個發揮舞台。位於彰濱工業區的臺灣玻璃館，館內介紹劃分為資訊知性區、工程內裝區、藝術創作區、生活玻璃區、親子體驗等主題區，除了玻璃藝術品外，還有大型的玻璃萬花筒，突破玻璃業傳統的刻板印象，讓人耳目一新，以寓教於樂的方式，使參觀者與玻璃都能有零距離的另類接觸，讓大眾深入了解這個晶瑩剔透的大千世界。"
                            );
                        }
                        if (num == "#10") {
                            $("#rightblock").attr("src", "./img/AA/10.jpg");
                            $("#tht").empty().append(
                                "國立自然科學博物館，簡稱科博館，是位於臺灣臺中市北區的公立科學博物館，是中華民國國家十二項建設文化建設項下興建的首座科學博物館。該館館區由科學中心、太空劇場、生命科學廳、人類文化廳、地球環境廳與植物園所共同組成。每年參觀人數居臺灣博物館第二，僅次於國立故宮博物院，平均三百萬人次左右。"
                            );
                        }
                        if (num == "#11") {
                            $("#rightblock").attr("src", "./img/AA/11.jpg");
                            $("#tht").empty().append(
                                "有機稻場是山水米公司為了推廣有機稻米種植，於2004年開始籌設的一個希望工作站。2006年，有機稻場正式對外營運，希望藉由這間漂浮在稻浪上的教室，和大家一同學習如何友善對待我們的土地，尊重所有的生命，以及關懷農人的生活創造農村生活美學。"
                            );
                        }
                        if (num == "#12") {
                            $("#rightblock").attr("src", "./img/AA/12.jpg");
                            $("#tht").empty().append(
                                "1989年時宜蘭當地人提出成立「開蘭博物館」的構想。1992年12月宜蘭縣政府決定成立「蘭陽博物館」，並將館址選在頭城鎮烏石港區。1999年3月20日成立「蘭陽博物館籌備處」。2004年8月開工建造。2010年5月18日開始第一階段試營運，同年6月25日第二階段試營運、10月16日正式開館。"
                            );
                        }
                        if (num == "#13") {
                            $("#rightblock").attr("src", "./img/AA/13.jpg");
                            $("#tht").empty().append(
                                "做為繪畫、攝影、雕塑、工藝的展覽空間，這座藝術場所從大門就展現饒富韻味的人文氛圍。大門的驚艷是湖口鄉三元宮捐贈的一對古董門神，以及關西太和宮贈與的「石珠」、「石陛」，珍貴百年歷史文物憑添濃郁的古典風華。 從大門到美術館是曲折迴廊與映照樹影花容的水塘林園，行經其間，有亭台樓閣曲徑通幽的詩意。美術館一樓與地下室共有七間展覽室，每間都是無柱設計，避免柱子對視覺產生干擾而影響觀賞；燈光設計以自然採光、人工照明的相互配合，讓展覽作品有最佳呈現，也讓參觀者有最優質的藝術品觀賞空間。"
                            );
                        }
                        if (num == "#14") {
                            $("#rightblock").attr("src", "./img/AA/14.jpg");
                            $("#tht").empty().append(
                                "新竹市眷村博物館是專門介紹新竹市眷村文化的博物館，在林政則市長任內規劃建設，成立於2002年，位於新竹市北區，為全臺灣第一間以眷村為主題的博物館。該博物館展示新竹市眷村的相關文物，大多是由新竹市眷村居民捐贈而來。"
                            );
                        }
                        if (num == "#15") {
                            $("#rightblock").attr("src", "./img/AA/15.jpg");
                            $("#tht").empty().append(
                                "位於龜山區光峰路千禧社區旁的眷村故事館，早期為龜山區陸光三村自治會辦公室，是眷村活動集會的重要場所，經在地居民共同保存成為情感交流的好所在。桃園市政府文化局為保存眷村文化資產精神，2004年登錄歷史建築，定名為「龜山眷村故事館」，成為陸光三村改建後唯一保留的老眷村建築。"
                            );
                        }
                        if (num == "#16") {
                            $("#rightblock").attr("src", "./img/AA/16.jpg");
                            $("#tht").empty().append(
                                "新北市立十三行博物館，簡稱十三行博物館，位於台灣新北市八里左岸，於1998年興建，2003年4月24日正式開館。為台灣第一座市立考古博物館，設立目的為保存及推廣十三行文化。舊名十三行遺址文物陳列館，1998年改名臺北縣立十三行博物館，2010年改為現名。"
                            );
                        }
                        if (num == "#17") {
                            $("#rightblock").attr("src", "./img/AA/17.jpg");
                            $("#tht").empty().append(
                                "國立故宮博物院，簡稱故宮，俗稱臺灣故宮或臺北故宮，別名中山博物院，為中華民國最具規模的博物館以及臺灣八景之一，也是古代中國藝術史與漢學研究機構。館舍坐落在臺北市士林區至善路2段221號和臺灣省嘉義縣太保市故宮大道888號，一年可接待超過614萬人次參訪旅客，曾位列2015年全球參觀人數第六多的藝術博物館。"
                            );
                        }



                        console.log(num);
                    });

                    $("#rightblock").fadeIn(1000, function () {

                    });
                })
            })
        }
    </script>
</body>

</html>